// DOM = Document Object Model
// ____________________________

// -------------------------------
// 画面に文字を表示するメソッド
// スクリプトの位置に表示されてしまう↓
// -------------------------------
// document.write('こんにちは');

// ____________________________________________________________

// ----------------------------------------------------------
// ↓ドキュメントの中にあるid名messageを取得してHTMLの内容を書き換えた
// ----------------------------------------------------------
document.querySelector('#message').innerHTML = '私の名前はDOMです';



// ---------------------------------------------------------
// windowは省略可能
// ↓ドキュメントのid名btn1を押した時に10時ですとアラートが出る指示
// 無名関数: () =>
// ---------------------------------------------------------


// --------------------------↓↓↓----------------------------


// _________________________________________________________________
// document.querySelector('#btn1').addEventListener('click', () => {
//     alert('10時です')
// });
// _________________________________________________________________


// ---------------------------------------------------------
// ↓btn1がクリックされた時にメッセージを13時ですに書きかえる処理
// ---------------------------------------------------------

document.querySelector('#btn1').addEventListener('click', () => {
    document.querySelector('#message').innerHTML = '13時です';
});